uhnp/src/Catalogs/ОбъектыВозникновенияЗатрат/ОбъектыВозникновенияЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбъектыВозникновенияЗатрат</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипРасходов</name>
    <type>
      <types>EnumRef.ТипыРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДеятельностиРасходов</name>
    <type>
      <types>EnumRef.ВидыДеятельностиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределенияРасходовУпр</name>
    <type>
      <types>EnumRef.ВариантыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределенияРасходовРегл</name>
    <type>
      <types>EnumRef.ВариантыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаспределенияРасходовНУ</name>
    <type>
      <types>EnumRef.ВариантыРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияРасходовУпр</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияРасходовРегл</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПравилоРаспределенияРасходовНУ</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяКалькуляции</name>
    <type>
      <types>CatalogRef.СтатьиКалькуляции</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИспользуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ОбъектыВозникновенияЗатрат/Forms/РазблокированиеРеквизитов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	РазрешитьРедактированиеОрганизацииПодразделения = Ложь;
	РазрешитьРедактированиеТипаИВариантовРаспределенияРасходов = Истина;
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура РазрешитьРедактирование(Команда)

	Результат = РедактируемыеРеквизиты();
	Закрыть(Результат);

КонецПроцедуры

&НаСервере
Функция РедактируемыеРеквизиты()
	
	Результат = Новый Массив;
	Если РазрешитьРедактированиеОрганизацииПодразделения Тогда
		Результат.Добавить(Метаданные.Справочники.ОбъектыВозникновенияЗатрат.Реквизиты.Организация.Имя);
		Результат.Добавить(Метаданные.Справочники.ОбъектыВозникновенияЗатрат.Реквизиты.Подразделение.Имя);
	КонецЕсли;
	Если РазрешитьРедактированиеТипаИВариантовРаспределенияРасходов Тогда
		Результат.Добавить(Метаданные.Справочники.ОбъектыВозникновенияЗатрат.Реквизиты.ТипРасходов.Имя);
		Результат.Добавить(Метаданные.Справочники.ОбъектыВозникновенияЗатрат.Реквизиты.ВариантРаспределенияРасходовУпр.Имя);
		Результат.Добавить(Метаданные.Справочники.ОбъектыВозникновенияЗатрат.Реквизиты.ВариантРаспределенияРасходовРегл.Имя);
		Результат.Добавить(Метаданные.Справочники.ОбъектыВозникновенияЗатрат.Реквизиты.ВариантРаспределенияРасходовНУ.Имя);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
